Repository: Yuleira/SectorZero
Catalog: Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %llds
zh_hans: %lld秒

source: +%lld EXP
zh_hans: +%lld 经验

# achievement_architect_desc
source: Own 10 buildings
zh_hans: 拥有10栋建筑

# achievement_architect_name
source: Architect
zh_hans: 建筑大师

# achievement_category_all
source: All
zh_hans: 全部

# achievement_category_building
source: Building
zh_hans: 建筑

# achievement_category_exploration
source: Exploration
zh_hans: 探索

# achievement_category_survival
source: Survival
zh_hans: 生存

# achievement_constructor_desc
source: Build your first building
zh_hans: 建造第一栋建筑

# achievement_constructor_name
source: Constructor
zh_hans: 建造师

# achievement_empty
source: No achievements yet
zh_hans: 暂无成就

# achievement_first_claim_desc
source: Claim your first territory
zh_hans: 占领你的第一块领地

# achievement_first_claim_name
source: First Claim
zh_hans: 初次占领

# achievement_first_steps_desc
source: Walk 1,000 meters
zh_hans: 行走1,000米

# achievement_first_steps_name
source: First Steps
zh_hans: 初行者

# achievement_land_baron_desc
source: Own 5 territories
zh_hans: 拥有5块领地

# achievement_land_baron_name
source: Land Baron
zh_hans: 地主

# achievement_locked
source: Locked
zh_hans: 未解锁

# achievement_marathon_desc
source: Walk 10,000 meters
zh_hans: 行走10,000米

# achievement_marathon_name
source: Marathon
zh_hans: 马拉松

source: Achievement Progress
zh_hans: 成就进度

# achievement_scout_desc
source: Discover 5 POIs
zh_hans: 发现5个兴趣点

# achievement_scout_name
source: Scout
zh_hans: 侦察兵

# achievement_show_unlocked
source: Show Unlocked Only
zh_hans: 仅显示已解锁

# achievement_territory_lord_desc
source: Accumulate 10,000 m² of territory
zh_hans: 累计领地面积达10,000平方米

# achievement_territory_lord_name
source: Territory Lord
zh_hans: 领地霸主

# achievement_unlocked
source: Unlocked
zh_hans: 已解锁

# achievement_veteran_desc
source: Survive for 30 days
zh_hans: 存活30天

# achievement_veteran_name
source: Veteran
zh_hans: 老兵

# achievement_week_survivor_desc
source: Survive for 7 days
zh_hans: 存活7天

# achievement_week_survivor_name
source: Week Survivor
zh_hans: 一周幸存者

# action_delete_channel
source: Delete Channel
zh_hans: 删除频道

# action_rename_channel
source: Rename Channel
zh_hans: 重命名频道

# action_skip
source: Skip
zh_hans: 跳过

source: ACTIVE
zh_hans: 活跃

source: All Devices
zh_hans: 所有设备

# auth_app_slogan
source: Build your territory in the wasteland
zh_hans: 在废土之上，建立你的领地

# auth_app_title
source: SectorZero
zh_hans: 零号扇区

# auth_back
source: Go Back
zh_hans: 返回上一步

# auth_code_placeholder
source: Enter 6-digit code
zh_hans: 请输入6位验证码

# auth_code_sent_to
source: Verification code sent to %@
zh_hans: 验证码已发送至 %@

# auth_code_sent_to %@
source: Verification code sent to %@
zh_hans: 验证码已发送至 %@

# auth_complete_registration
source: Complete Registration
zh_hans: 完成注册

# auth_confirm_password
source: Confirm Password
zh_hans: 确认密码

# auth_email_placeholder
source: Email Address
zh_hans: 邮箱地址

# auth_enter_code
source: Enter Code
zh_hans: 输入验证码

# auth_enter_email_for_code
source: Enter email to get verification code
zh_hans: 输入邮箱获取验证码

# auth_forgot_password
source: Forgot Password?
zh_hans: 忘记密码？

# auth_go_to_login
source: Go to Login
zh_hans: 前往登录

# auth_login
source: Login
zh_hans: 登录

# auth_login_required
source: Please Log In
zh_hans: 请先登录

# auth_or_sign_in_with
source: Or sign in with
zh_hans: 或者使用以下方式登录

# auth_password_mismatch
source: Passwords do not match
zh_hans: 两次输入的密码不一致

# auth_password_placeholder
source: Password
zh_hans: 密码

# auth_password_too_weak
source: Password must be 12+ chars with mixed cases, numbers & symbols
zh_hans: 密码需至少12位，包含大小写、数字和符号

# auth_password_valid
source: Password looks strong
zh_hans: 密码强度合格

# auth_register
source: Register
zh_hans: 注册

# auth_resend_code
source: Resend Code
zh_hans: 重新发送

# auth_resend_countdown
source: Resend in %llds
zh_hans: %lld秒后重发

# auth_resend_countdown %lld
source: Resend in %llds
zh_hans: %lld秒后可重发

# auth_send_code
source: Send Code
zh_hans: 发送验证码

# auth_set_password
source: Set Password
zh_hans: 设置登录密码

# auth_set_password_hint
source: Please set a secure password to complete registration
zh_hans: 请设置一个安全的密码以完成注册

# auth_sign_in_apple
source: Sign in with Apple
zh_hans: 通过 Apple 登录

# auth_sign_in_google
source: Sign in with Google
zh_hans: 通过 Google 登录

# auth_user_cancelled_login
source: User cancelled login
zh_hans: 用户取消了登录

# auth_verify
source: Verify
zh_hans: 验证

# backpack_empty_subtitle
source: Go explore to collect resources
zh_hans: 去探索收集物资吧

# backpack_empty_title
source: Backpack is Empty
zh_hans: 背包空空如也

# backpack_generated_items
source: Generated Items
zh_hans: 生成的物品

# backpack_no_results_subtitle
source: Try other keywords or clear filters
zh_hans: 试试其他关键词或清除筛选条件

# backpack_no_results_title
source: No Items Found
zh_hans: 没有找到相关物品

# backpack_search_placeholder
source: Search items...
zh_hans: 搜索物品...

# backpack_title
source: Backpack
zh_hans: 背包

# building_browser_empty_description
source: This category currently has no building templates.
zh_hans: 该分类下没有可用的建筑模板

# building_browser_empty_title
source: No Buildings Yet
zh_hans: 暂无建筑

# building_browser_title
source: Building Browser
zh_hans: 建筑浏览

# building_build
source: Build
zh_hans: 建造

# building_build_time
source: Build Time
zh_hans: 建造时间

# building_completing
source: Completing
zh_hans: 即将完成

# building_confirm_construction
source: Confirm Construction
zh_hans: 确认建造

# building_confirm_location
source: Confirm Location
zh_hans: 确认位置

# building_construction_failed
source: Construction Failed
zh_hans: 建造失败

# building_construction_started_format
source: Construction started: %@
zh_hans: 建造已开始：%@

# building_construction_started_format %@
source: %1$@ construction has started
zh_hans: %1$@ 建造已开始

# building_construction_success
source: Construction Started
zh_hans: 建造已开始

# building_count_format %lld
source: Count: %1$lld
zh_hans: 数量: %1$lld

# building_demolish
source: Demolish
zh_hans: 拆除

# building_demolish_confirm
source: Confirm Demolition
zh_hans: 确认拆除

# building_demolish_message %@
source: Are you sure you want to demolish %1$@? Resources will not be refunded.
zh_hans: 确定要拆除 %1$@ 吗？资源将不会返还。

# building_description_campfire
source: A simple fire pit that keeps you warm and cooks food.
zh_hans: 一个简单的火堆，可以取暖和烤食物。

# building_description_shelter_frame
source: A basic shelter that shields you from the elements.
zh_hans: 一个基础避难所，可抵御恶劣天气。

# building_description_small_cache
source: A wooden crate for storing scavenged materials.
zh_hans: 用于储存打捞来的物资的木箱。

# building_description_solar_array
source: Harnesses sunlight to power your outpost.
zh_hans: 吸收阳光为你的据点提供能量。

# building_description_workbench
source: A sturdy bench for crafting better gear.
zh_hans: 一个坚固的工作台，能打造更好的装备。

# building_error_no_location
source: Please select a location on the map
zh_hans: 请在地图上选择位置

# building_level_format %lld
source: Level %1$lld
zh_hans: 等级 %1$lld

# building_limit_reached %lld/%lld
source: Limit reached (%1$lld/%2$lld)
zh_hans: 已达上限（%1$lld/%2$lld）

# building_location_coordinates
source: Location Coordinates
zh_hans: 位置坐标

# building_location_invalid
source: Invalid Location
zh_hans: 无效位置

# building_location_outside_territory
source: Selected location is outside your territory
zh_hans: 所选位置不在您的领地范围内

# building_location_selected
source: Location Selected
zh_hans: 已选位置

# building_max_limit_format %lld
source: Max %1$lld
zh_hans: 上限 %1$lld

# building_max_per_territory
source: Max Per Territory
zh_hans: 每领地上限

# building_max_reached
source: Build Limit Reached
zh_hans: 已达建造上限

# building_name_campfire
source: Campfire
zh_hans: 篝火

# building_name_shelter_frame
source: Shelter Frame
zh_hans: 避难所结构

# building_name_small_cache
source: Small Cache
zh_hans: 小型储物箱

# building_name_solar_array
source: Solar Array
zh_hans: 太阳能阵列

# building_name_workbench
source: Workbench
zh_hans: 工作台

# building_place_title
source: Place Building
zh_hans: 放置建筑

# building_resources_insufficient
source: Insufficient Resources
zh_hans: 资源不足

# building_resources_sufficient
source: Enough Resources
zh_hans: 资源充足

# building_select_location
source: Select Location
zh_hans: 选择位置

# building_selected_location
source: Selected Location
zh_hans: 选定位置

# building_start_construction
source: Start Construction
zh_hans: 开始建造

# building_tap_to_place
source: Tap to place building
zh_hans: 点击放置建筑

# building_tap_to_select_location
source: Tap on the map to select a location
zh_hans: 点击地图选择位置

# building_tier_format %lld
source: Tier %1$lld
zh_hans: 等级 %1$lld

# building_upgrade
source: Upgrade Building
zh_hans: 升级建筑

# building_upgrade_unavailable
source: Upgrade Unavailable
zh_hans: 无法升级

# Built %lld/%lld
source: Built %1$lld/%2$lld
zh_hans: 已建 %1$lld/%2$lld

source: Call Center
zh_hans: 呼叫中心

source: Call Content
zh_hans: 呼叫内容

# call_content_placeholder
source: Enter your call content, then hold PTT to send
zh_hans: 输入您的呼叫内容，然后按住PTT按钮发送

# callsign_explanation
source: Callsign is your identity on the airwaves. Other survivors will identify you by your callsign, like "CQ CQ, this is BJ-Alpha-001".
zh_hans: 呼号是您在电波中的身份标识，其他幸存者会通过呼号识别您。就像真实电台中的「CQ CQ，这里是 BJ-Alpha-001」。

# callsign_format_hint
source: Only letters, numbers, and hyphens
zh_hans: 仅支持字母、数字和连字符（-）

# callsign_invalid_format
source: Callsign can only contain letters, numbers, and hyphens
zh_hans: 呼号只能包含字母、数字和连字符

# callsign_placeholder
source: Enter callsign (3-20 characters)
zh_hans: 输入呼号（3-20字符）

source: Callsign Saved
zh_hans: 保存成功

source: Callsign Settings
zh_hans: 呼号设置

# callsign_updated_format
source: Your callsign is now: %@
zh_hans: 您的呼号已更新为：%@

source: Can Send
zh_hans: 可发送

# category_all
source: All
zh_hans: 全部

# category_emergency_alert
source: Emergency Alert
zh_hans: 紧急广播

# category_energy
source: Energy
zh_hans: 能源设施

# category_food
source: Food
zh_hans: 食物

# category_game_news
source: Game News
zh_hans: 游戏资讯

# category_material
source: Material
zh_hans: 材料

# category_medical
source: Medical
zh_hans: 药品

# category_mission_release
source: Mission Release
zh_hans: 任务发布

# category_other
source: Other
zh_hans: 其他

# category_production
source: Production
zh_hans: 生产设施

# category_storage
source: Storage
zh_hans: 储存设施

# category_survival
source: Survival
zh_hans: 生存设施

# category_survival_guide
source: Survival Guide
zh_hans: 生存指南

# category_tool
source: Tool
zh_hans: 工具

# category_water
source: Water
zh_hans: 水

# category_weapon
source: Weapon
zh_hans: 武器

source: Channel Center
zh_hans: 频道中心

source: Channel Code:
zh_hans: 频道码：

# channel_creator
source: You are the creator
zh_hans: 你是创建者

# channel_desc_camp
source: Camp-based broadcast
zh_hans: 营地广播

# channel_desc_official
source: System announcements and news
zh_hans: 系统公告与新闻

# channel_desc_public
source: Open to all survivors
zh_hans: 向所有幸存者开放

# channel_desc_satellite
source: Long-range satellite link
zh_hans: 远程卫星链路

# channel_desc_walkie
source: Short-range communication
zh_hans: 短距离通讯

# channel_description
source: Description
zh_hans: 频道描述

source: Channel Details
zh_hans: 频道详情

source: Channel Info
zh_hans: 频道信息

source: Channel List
zh_hans: 频道列表

source: Channel Name
zh_hans: 频道名称

# channel_name_length_hint
source: 2-50 characters
zh_hans: 2-50个字符

# channel_name_too_long
source: Name too long (max 50 characters)
zh_hans: 名称过长（最多50个字符）

# channel_name_too_short
source: Name too short (min 2 characters)
zh_hans: 名称过短（至少2个字符）

# channel_type
source: Type
zh_hans: 类型

# channel_type_camp
source: Camp
zh_hans: 营地

# channel_type_official
source: Official
zh_hans: 官方

# channel_type_public
source: Public
zh_hans: 公共

# channel_type_satellite
source: Satellite
zh_hans: 卫星

# channel_type_walkie
source: Walkie-Talkie
zh_hans: 对讲机

source: Chat Interface
zh_hans: 聊天界面

# common_back
source: Back
zh_hans: 返回

# common_cancel
source: Cancel
zh_hans: 取消

# common_close
source: Close
zh_hans: 关闭

# common_collapse
source: Collapse
zh_hans: 收起

# common_confirm
source: Confirm
zh_hans: 确认

# common_delete
source: Delete
zh_hans: 删除

# common_done
source: Done
zh_hans: 完成

# common_error
source: Error
zh_hans: 错误

# common_failed
source: Failed
zh_hans: 失败

# common_later
source: Later
zh_hans: 稍后再说

# common_loading
source: Loading...
zh_hans: 加载中...

# common_locked
source: Locked
zh_hans: 锁定

# common_more_features
source: More Features
zh_hans: 更多功能

# common_ok
source: OK
zh_hans: 确定

# common_retry
source: Retry
zh_hans: 重试

# common_save
source: Save
zh_hans: 保存

# common_settings
source: Settings
zh_hans: 设置

# common_territory
source: Territory
zh_hans: 领地

# communication
source: Comms
zh_hans: 通讯

source: Communication Center
zh_hans: 通讯中心

source: Confirm
zh_hans: 确定

source: Confirm Delete
zh_hans: 确认删除

# coverage_format
source: Coverage: %@
zh_hans: 覆盖范围: %@

source: Create Channel
zh_hans: 创建频道

# create_first_channel_hint
source: Create your first channel to start broadcasting
zh_hans: 创建你的第一个频道开始广播

# created_at
source: Created
zh_hans: 创建时间

# creating_channel
source: Creating...
zh_hans: 创建中...

source: Current
zh_hans: 当前

source: Day 33 Implementation
zh_hans: Day 33 实现

source: Day 34 Implementation
zh_hans: Day 34 实现

source: Day 36 Implementation
zh_hans: Day 36 实现

# debug_add_materials
source: Add Materials (Debug)
zh_hans: 添加材料（调试）

source: Delete Channel
zh_hans: 删除频道

# delete_channel_confirm
source: Delete this channel?
zh_hans: 确定删除此频道？

# delete_channel_confirm_message
source: This will permanently delete the channel and all subscriptions. This action cannot be undone.
zh_hans: 这将永久删除该频道及所有订阅。此操作无法撤销。

# density_alone
source: Lone Survivor
zh_hans: 独行者

# density_alone_desc
source: No other survivors nearby
zh_hans: 附近没有其他幸存者

# density_high
source: High Density
zh_hans: 高密度

# density_high_desc
source: Many survivors nearby
zh_hans: 附近有很多幸存者

# density_low
source: Low Density
zh_hans: 低密度

# density_low_desc
source: Few survivors nearby
zh_hans: 附近幸存者较少

# density_medium
source: Medium Density
zh_hans: 中密度

# density_medium_desc
source: Some survivors nearby
zh_hans: 附近有一些幸存者

# desc_broadcast_range_format
source: Broadcast within %lld km
zh_hans: 可在 %lld 公里范围内广播

# desc_comm_range_format
source: Communicate within %lld km
zh_hans: 可在 %lld 公里范围内通讯

# desc_contact_range_format
source: Contact within %lld+ km
zh_hans: 可在 %lld+ 公里范围内联络

# desc_receive_only
source: Receive only; cannot send
zh_hans: 只能接收信号，无法发送消息

# detail_after
source: After
zh_hans: 购买后

# detail_archon_desc
source: Become an Archon — the ultimate SectorZero commander. Claim up to 25 territories, enjoy unlimited scans, and expand your storage to 600 slots.
zh_hans: 成为执政官——零号区域的终极指挥官。可占领最多25块领地，享受无限次扫描，背包容量扩展至600格。

# detail_archon_headline
source: Ultimate Commander Tier
zh_hans: 终极指挥官等级

# detail_coin_desc
source: Aether Coins are the primary currency in SectorZero. Use them at the Resource Exchange to trade for building materials — Wood, Stone, Metal, and Fabric — essential for constructing and upgrading your territories.
zh_hans: 以太币是零号区域的主要货币。在资源交易所中用它们兑换建筑材料——木材、石材、金属和织物——这些都是建造和升级领地的必需品。

# detail_coin_headline
source: Fuel the Economy
zh_hans: 驱动经济循环

# detail_energy_cost_per_scan
source: Each POI scan costs 1 Aether Energy
zh_hans: 每次扫描POI消耗1点以太能量

# detail_energy_desc
source: Aether Energy powers your AI exploration scans. Each scan of a POI costs 1 energy and analyzes nearby points of interest to generate unique items based on real-world locations. More energy means more scans, more discoveries, and more rare finds.
zh_hans: 以太能量为你的AI探索扫描提供动力。每次扫描一个POI消耗1点能量，系统会分析附近的兴趣点并根据现实世界位置生成独特物品。更多能量意味着更多扫描、更多发现和更多稀有收获。

# detail_energy_headline
source: Power Your Scans
zh_hans: 为扫描充能

# detail_energy_scan_pois
source: Scan nearby POIs to discover unique items
zh_hans: 扫描附近的兴趣点以发现独特物品

# detail_energy_scans_count
source: Instantly adds to your energy balance
zh_hans: 立即充入你的能量余额

# detail_label_ai_scans
source: AI Scans
zh_hans: AI扫描

# detail_label_coins
source: Coins
zh_hans: 金币

# detail_label_daily_coins
source: Daily Coins
zh_hans: 每日金币

# detail_label_daily_energy
source: Daily Energy
zh_hans: 每日能量

# detail_label_energy
source: Energy
zh_hans: 能量

# detail_label_storage
source: Storage
zh_hans: 背包容量

# detail_label_territories
source: Territories
zh_hans: 领地

# detail_now
source: Now
zh_hans: 当前

# detail_pioneer_desc
source: Level up to Pioneer for enhanced exploration. Claim up to 10 territories, receive 10 daily scans, and expand your storage to 300 slots.
zh_hans: 升级为先驱者，增强探索能力。可占领最多10块领地，每日获得10次扫描，背包容量扩展至300格。

# detail_pioneer_headline
source: Enhanced Explorer Tier
zh_hans: 增强探索者等级

# detail_salvager_desc
source: Start your journey as a Salvager. Claim up to 5 territories, receive 5 daily scans, and expand your storage to 150 slots.
zh_hans: 以资源回收者身份开启旅程。可占领最多5块领地，每日获得5次扫描，背包容量扩展至150格。

# detail_salvager_headline
source: Basic Survivor Tier
zh_hans: 基础幸存者等级

# detail_storage_desc
source: Permanently expand your inventory capacity by 100 slots. Store more items collected from AI scans and exploration. This is a one-time purchase that lasts forever — no subscription required.
zh_hans: 永久扩展100格背包容量。存储更多从AI扫描和探索中收集的物品。这是一次性购买，永久有效——无需订阅。

# detail_storage_headline
source: Expand Your Arsenal
zh_hans: 扩展你的储备

# detail_unlimited
source: Unlimited
zh_hans: 无限

# detailed_stats_active_days
source: Active Days
zh_hans: 活跃天数

# detailed_stats_activity
source: Activity Stats
zh_hans: 活动统计

# detailed_stats_area
source: Area
zh_hans: 面积

# detailed_stats_buildings
source: Buildings Owned
zh_hans: 拥有建筑

# detailed_stats_calories
source: Calories
zh_hans: 卡路里

# detailed_stats_distance
source: Distance
zh_hans: 距离

# detailed_stats_exploration
source: Exploration Stats
zh_hans: 探索统计

# detailed_stats_game_time
source: Game Time
zh_hans: 游戏时间

# detailed_stats_items
source: Items Collected
zh_hans: 收集物品

# detailed_stats_pois
source: POIs Found
zh_hans: 发现POI

# detailed_stats_resources
source: Resource Stats
zh_hans: 资源统计

# detailed_stats_steps
source: Steps
zh_hans: 步数

# detailed_stats_storage
source: Storage Capacity
zh_hans: 存储容量

# detailed_stats_territories
source: Territories Owned
zh_hans: 拥有领地

# detailed_stats_title
source: Detailed Statistics
zh_hans: 详细统计

# dev_tools_warning
source: These tools are for development debugging only
zh_hans: 这些工具仅供开发调试使用

# device_base_station
source: Base Station
zh_hans: 营地电台

source: Device Management
zh_hans: 设备管理

source: Device Not Unlocked
zh_hans: 设备未解锁

# device_radio
source: Radio
zh_hans: 收音机

# device_requires_archon_tier
source: Satellite requires Archon subscription
zh_hans: 卫星通讯需要执政官订阅等级

# device_satellite
source: Satellite
zh_hans: 卫星通讯

# device_walkie_talkie
source: Walkie-Talkie
zh_hans: 对讲机

# discover_channels
source: Discover
zh_hans: 发现

# distance_meters_format
source: %.0f meters
zh_hans: %.0f米

# energy_depleted_message
source: Your aether energy is depleted.
zh_hans: 您的以太能量已耗尽。

# energy_depleted_title
source: Energy Depleted
zh_hans: 能量耗尽

source: Enter Chat
zh_hans: 进入聊天

# error_add_item_failed_format
source: Failed to add item: %@
zh_hans: 添加物品失败：%@

# error_building_templates_not_found
source: Building templates file not found
zh_hans: 未找到建筑模板文件

# error_cannot_claim_in_others_territory
source: Cannot start claiming inside another player's territory!
zh_hans: 不能在他人领地内开始圈地！

# error_cannot_get_apple_credentials
source: Cannot get Apple login credentials
zh_hans: 无法获取 Apple 登录凭证

# error_cannot_get_google_token
source: Cannot get Google ID Token
zh_hans: 无法获取 Google ID Token

# error_cannot_get_location
source: Cannot get location, please try again later
zh_hans: 无法获取位置，请稍后重试

# error_cannot_get_root_view_controller
source: Cannot get root view controller
zh_hans: 无法获取根视图控制器

# error_channel_name_empty
source: Channel name cannot be empty
zh_hans: 频道名称不能为空

# error_complete_construction_failed
source: Failed to complete construction
zh_hans: 完成建造失败

# error_construction_failed
source: Construction failed
zh_hans: 建造失败

# error_create_channel_failed_format
source: Failed to create channel: %@
zh_hans: 创建频道失败：%@

# error_create_channel_parse_failed
source: Failed to parse channel response
zh_hans: 频道响应解析失败

# error_database_format
source: Database error: %@
zh_hans: 数据库错误：%@

# error_delete_channel_failed_format
source: Failed to delete channel: %@
zh_hans: 删除频道失败：%@

# error_delete_failed_format
source: Delete failed: %@
zh_hans: 删除失败：%@

# error_demolish_failed
source: Demolition failed
zh_hans: 拆除失败

# error_email_already_registered
source: This email is already registered
zh_hans: 该邮箱已注册

# error_email_or_password_incorrect
source: Incorrect email or password
zh_hans: 邮箱或密码错误

# error_email_sent_too_frequently
source: Email sent too frequently, please try again later
zh_hans: 发送邮件过于频繁，请稍后再试

# error_exploration_speed_exceeded
source: Exploration failed: speed exceeded 30km/h, possibly used a vehicle
zh_hans: 探索失败：移动速度超过30km/h，可能使用了交通工具

# error_google_login_not_configured
source: Google login not configured, please set Client ID first
zh_hans: Google 登录未配置，请先设置 Client ID

# error_initialization_failed_format
source: Initialization failed: %@
zh_hans: 初始化失败：%@

# error_insufficient_area_format
source: Insufficient area: %.0fm² (need ≥%dm²)
zh_hans: 面积不足: %.0fm² (需≥%dm²)

# error_insufficient_distance_format
source: Insufficient distance: %.0fm (need ≥%dm)
zh_hans: 距离不足: %.0fm (需≥%dm)

# error_insufficient_points_format
source: Insufficient points: %d (need ≥%d)
zh_hans: 点数不足: %d个 (需≥%d个)

# error_insufficient_resources
source: Insufficient resources: %1$@
zh_hans: 资源不足：%1$@

# error_invalid_coordinates
source: Invalid coordinate data
zh_hans: 坐标数据无效

# error_invalid_email_format
source: Invalid email format
zh_hans: 邮箱格式无效

# error_invalid_status
source: Invalid status
zh_hans: 状态无效

# error_load_backpack
source: Failed to load backpack: %@
zh_hans: 加载背包失败: %@

# error_load_building_templates_failed
source: Failed to load building templates
zh_hans: 加载建筑模板失败

# error_load_buildings_failed
source: Failed to load buildings
zh_hans: 加载建筑失败

# error_load_channels_failed_format
source: Failed to load channels: %@
zh_hans: 加载频道失败：%@

# error_load_failed_format
source: Load failed: %@
zh_hans: 加载失败：%@

# error_load_messages_failed_format
source: Failed to load messages: %@
zh_hans: 加载消息失败：%@

# error_load_subscriptions_failed_format
source: Failed to load subscriptions: %@
zh_hans: 加载订阅失败：%@

# error_location_failed_format
source: Location failed: %@
zh_hans: 定位失败: %@

# error_location_permission_denied
source: Location permission denied, please enable in Settings
zh_hans: 定位权限被拒绝，请在设置中开启

# error_location_permission_required
source: Location permission required
zh_hans: 需要定位权限

# error_logout_failed_session_cleared
source: Logout failed, local session cleared
zh_hans: 退出登录失败，已清除本地会话

# error_max_buildings_reached
source: Build limit reached: %1$lld per territory
zh_hans: 已达建造上限：每领地 %1$lld 个

# error_message_content_empty
source: Message content cannot be empty
zh_hans: 消息内容不能为空

# error_network_connection_failed
source: Network connection failed, please check your network
zh_hans: 网络连接失败，请检查网络

# error_network_error
source: Network error, please check your network connection
zh_hans: 网络错误，请检查网络连接

# error_not_authenticated
source: Not authenticated
zh_hans: 未认证

# error_not_logged_in
source: Not logged in, please log in first
zh_hans: 未登录，请先登录

# error_operation_failed_format
source: Operation failed: %@
zh_hans: 操作失败: %@

# error_operation_too_frequent
source: Operation too frequent, please try again later
zh_hans: 操作过于频繁，请稍后再试

# error_password_min_length
source: Password must be at least 6 characters
zh_hans: 密码至少需要6个字符

# error_path_crosses_others_territory
source: Path crosses another player's territory boundary
zh_hans: 路径碰撞：轨迹穿越他人领地边界

# error_path_enters_others_territory
source: Path point enters another player's territory
zh_hans: 路径碰撞：轨迹点进入他人领地

# error_remove_item
source: Failed to remove item: %@
zh_hans: 移除物品失败：%@

# error_request_timeout
source: Request timed out
zh_hans: 请求超时
